app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT  "pages".* FROM "pages" LIMIT ?  [["LIMIT", 11]]

  def show
    @page = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]